Repository: Jeff2Ma/WhistleYoo
Catalog: Sources/whistleYooCore/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# rules.the_default_rule_must_remain_present_and_enabled
source: 默认规则必须保留且保持启用
en: The Default rule must remain present and enabled

# rules.the_default_rule_name_is_reserved
source: 默认规则名称已保留
en: The Default rule name is reserved

# rules.the_default_rule_s_enabled_state_cannot_be_changed
source: 默认规则启用状态不能修改
en: The Default rule's enabled state cannot be changed

# rules.the_new_rule_is_enabled_automatically_click_save_after_finishing_all_rul
source: 创建后会自动启用；完成编辑后请点击全局保存。
en: The new rule is enabled automatically. Click Save after finishing all rule edits.

# rules.the_rule_name_cannot_be_empty_or_contain_leading_or_trailing_whitespace
source: 规则名称不能为空或包含首尾空白
en: The rule name cannot be empty or contain leading or trailing whitespace

# rules.the_whistle_rule_operation_failed
source: Whistle 规则操作失败
en: The Whistle rule operation failed

# rules.the_whistle_rules_api_returned_an_invalid_response
source: Whistle 规则接口响应异常
en: The Whistle rules API returned an invalid response

# rules.this_removes_value_from_whistleyoo_s_dedicated_whistle_rule_storage_afte
source: 点击全局保存后会从 Whistle 的专属规则存储中删除“%@”。
en: This removes “%@” from WhistleYoo's dedicated Whistle rule storage after you click Save.

# rules.try_another_search_term
source: 换个关键词试试
en: Try another search term

# rules.unsaved
source: 未保存
en: Unsaved

# rules.value_lines
source: %lld 行
en: %lld lines

# rules.value_matches
source: %lld 处匹配
en: %lld matches

# rules.value_rule_sets_found_clear_search_to_reorder
source: 找到 %lld 个规则集 · 清除搜索后可排序
en: %lld rule sets found · Clear search to reorder

# settings.about
source: 关于
en: About

# settings.apply_and_restart
source: 应用并重启
en: Apply and Restart

# settings.applying_these_changes_will_restart_the_proxy_engine
source: 应用后将自动重启代理引擎
en: Applying these changes will restart the proxy engine

# settings.check_again
source: 重新检测
en: Check Again

# settings.check_and_start
source: 检查并启动
en: Check and Start

source: 检测 Finder 启动环境以及 nvm、fnm、Volta、Homebrew 常用目录。
en: Check the Finder launch environment and common nvm, fnm, Volta, and Homebrew directories.

# settings.choose_custom_save_location
source: 自定义保存路径…
en: Choose Custom Save Location…

# settings.choose_whistleyoo_configuration_save_location
source: 选择 WhistleYoo 配置保存路径
en: Choose WhistleYoo Configuration Save Location

# settings.compatibility_domain_filtering
source: 兼容性域名过滤
en: Compatibility Domain Filtering

# settings.compatibility_domains_saved
source: 兼容域名已保存
en: Compatibility domains saved

# settings.configuration_export_failed
source: 配置导出失败
en: Configuration export failed

# settings.configuration_exported
source: 配置已导出
en: Configuration exported

# settings.configuration_import_failed
source: 配置导入失败
en: Configuration import failed

# settings.configuration_imported_and_applied
source: 配置已导入并应用
en: Configuration imported and applied

# settings.configuration_save_location_updated
source: 配置保存路径已更新
en: Configuration save location updated

# settings.control_app_launch_dock_and_menu_bar_behavior
source: 控制应用启动、程序坞和菜单栏行为。
en: Control app launch, Dock, and menu bar behavior.

# settings.copy_whistle_install_command
source: 复制 Whistle 安装命令
en: Copy Whistle Install Command

# settings.custom_save_location
source: 自定义保存路径
en: Custom Save Location

# settings.default_configuration_save_location_restored
source: 已恢复默认配置保存路径
en: Default configuration save location restored

# settings.default_save_location
source: 默认保存路径
en: Default Save Location

# settings.disable_system_proxy_before_changing_network_services_help
source: 请先关闭系统代理，再修改网络服务。
en: Disable the system proxy before changing network services.

# settings.disable_the_system_proxy_before_changing_network_services
source: 请先关闭系统代理，再修改网络服务
en: Disable the system proxy before changing network services

# settings.discard_unsaved_changes
source: 放弃未保存的修改？
en: Discard Unsaved Changes?

# settings.edit_built_in_domains_value
source: 编辑内置域名（%lld 个）
en: Edit Built-in Domains (%lld)

# settings.enable_global_system_proxy
source: 开启全局系统代理
en: Enable Global System Proxy

source: 每行填写一个域名，支持 * 和 *** 通配形式。保存后会立即更新运行中的 Whistle 规则。
en: Enter one domain per line. * and *** wildcard forms are supported. Saving immediately updates the running Whistle rules.

# settings.export
source: 导出
en: Export

# settings.export_configuration
source: 导出配置…
en: Export Configuration…

# settings.export_whistleyoo_configuration
source: 导出 WhistleYoo 配置
en: Export WhistleYoo Configuration

# settings.general
source: 通用设置
en: General

# settings.global_system_proxy
source: 全局系统代理
en: Global System Proxy

# settings.https_capture_is_ready
source: HTTPS 抓包已就绪
en: HTTPS capture is ready

# settings.import
source: 导入
en: Import

# settings.import_configuration
source: 导入配置…
en: Import Configuration…

# settings.import_whistleyoo_configuration
source: 导入 WhistleYoo 配置
en: Import WhistleYoo Configuration

source: 统一保存全部设置项和规则配置，并支持云盘同步。
en: Keep all settings and rule configuration in one file with cloud-drive sync support.

# settings.launch_whistleyoo_at_login
source: 登录时自动启动 WhistleYoo
en: Launch WhistleYoo at Login

# settings.listen_on_0_0_0_0
source: 监听 0.0.0.0
en: Listen on 0.0.0.0

# settings.listen_on_127_0_0_1_only
source: 仅监听 127.0.0.1
en: Listen on 127.0.0.1 only

# settings.more_settings
source: 更多设置
en: More Settings

# settings.network_services_using_the_system_proxy
source: 应用系统代理的网络服务
en: Network Services Using the System Proxy

# settings.network_services_using_the_system_proxy_value_selected
source: 应用系统代理的网络服务（已选择 %lld 个）
en: Network Services Using the System Proxy (%lld selected)

# settings.no_available_network_services_detected
source: 没有检测到可用的网络服务
en: No available network services detected

# settings.open_whistle_console
source: 打开 Whistle 面板
en: Open Whistle Console

# settings.proxy_engine_is_not_running
source: 代理引擎未运行
en: Proxy engine is not running

# settings.proxy_engine_is_running
source: 代理引擎运行正常
en: Proxy engine is running

# settings.quit
source: 退出
en: Quit

# settings.reinstall_certificate_action
source: 重新安装证书…
en: Reinstall Certificate…

# settings.restore_default_location
source: 恢复默认路径
en: Restore Default Location

# settings.restore_defaults
source: 恢复默认
en: Restore Defaults

# settings.root_certificate_not_installed
source: 根证书未安装
en: Root certificate not installed

# settings.running
source: 运行中
en: Running

# settings.runtime_environment
source: 运行环境
en: Runtime Environment

# settings.runtime_environment_is_ready
source: 运行环境已就绪
en: Runtime environment is ready

# settings.runtime_environment_needs_attention
source: 需要准备运行环境
en: Runtime environment needs attention

# settings.save_domains
source: 保存域名
en: Save Domains

# settings.show_whistleyoo_in_the_dock
source: 在程序坞中显示 WhistleYoo
en: Show WhistleYoo in the Dock

# settings.shut_down_and_quit
source: 关闭并退出
en: Shut Down and Quit

# settings.start_the_proxy_engine_to_use_the_whistle_console
source: 启动代理引擎后即可使用 Whistle 面板。
en: Start the proxy engine to use the Whistle console.

# settings.stop_proxy_engine
source: 停止代理引擎
en: Stop Proxy Engine

# settings.switching_pages_will_discard_the_unsaved_changes_in_the_current_rule
source: 切换页面将放弃当前规则中未保存的修改。
en: Switching pages will discard the unsaved changes in the current rule.

# settings.system_proxy
source: 系统代理
en: System Proxy

# settings.the_proxy_engine_is_not_running
source: 代理引擎当前未运行
en: The proxy engine is not running

# settings.the_system_proxy_is_changing_please_wait
source: 系统代理正在切换，请稍候。
en: The system proxy is changing. Please wait.

# settings.this_mac
source: 本机
en: This Mac

# settings.unable_to_restore_the_default_configuration_save_location
source: 无法恢复默认配置保存路径
en: Unable to restore the default configuration save location

# settings.unable_to_update_the_configuration_save_location
source: 无法更新配置保存路径
en: Unable to update the configuration save location

# settings.use_this_location
source: 使用此路径
en: Use This Location

source: 关闭时 Whistle 仍会监听，可供手机或手动配置代理使用。
en: When disabled, Whistle continues listening for mobile devices and manually configured proxies.

source: 应用退出时会恢复由 WhistleYoo 修改的系统代理，并停止专属 Whistle 实例。
en: When the app quits, it restores the system proxy settings changed by WhistleYoo and stops its dedicated Whistle instance.

source: Whistle 已就绪，之后可以从状态栏随时控制代理。
en: Whistle is ready. You can control the proxy from the menu bar at any time.

# settings.whistleyoo_configuration_file
source: WhistleYoo 配置文件
en: WhistleYoo Configuration File

# settings.with_a_custom_location_the_app_reads_this_file_at_launch_and_atomically
source: 使用自定义路径后，应用启动时会从该文件读取配置，设置或规则保存后也会自动原子写回。
en: With a custom location, the app reads this file at launch and atomically writes back after settings or rules are saved.

# settings.you_can_skip_this_for_now_but_https_capture_will_not_work
source: 可以暂时跳过，但 HTTPS 抓包会失败
en: You can skip this for now, but HTTPS capture will not work

# status.a_rule_with_this_name_already_exists
source: 已存在同名规则
en: A rule with this name already exists

# status.another_proxy_configuration_exists_whistleyoo_has_not_taken_control
source: 系统中存在其他代理配置，WhistleYoo 未接管
en: Another proxy configuration exists; WhistleYoo has not taken control

# status.another_proxy_detected
source: 检测到其他代理
en: Another Proxy Detected

# status.available_after_starting_the_proxy_engine
source: 启动代理引擎后可用
en: Available after starting the proxy engine

# status.checking
source: 正在检测…
en: Checking…

# status.checking_node_js_and_whistle
source: 正在检测 Node.js 与 Whistle…
en: Checking Node.js and Whistle…

# status.configuration_import_failed_value_restoring_the_previous_configuration_a
source: 配置导入失败：%@；恢复原配置失败：%@
en: Configuration import failed: %@; restoring the previous configuration also failed: %@

# status.connected
source: 已接入
en: Connected

# status.environment_check_failed
source: 环境检测失败
en: Environment check failed

# status.environment_not_ready
source: 环境未就绪
en: Environment Not Ready

# status.keep_at_least_one_allowlisted_domain
source: 请至少保留一个白名单域名
en: Keep at least one allowlisted domain

# status.local_proxy
source: 本机代理
en: Local Proxy

# status.mac_traffic_is_not_connected_mobile_and_manual_proxies_are_still_availab
source: Mac 流量尚未接入，手机和手动代理仍可使用
en: Mac traffic is not connected; mobile and manual proxies are still available

# status.no_network_services_are_available
source: 没有可用的网络服务
en: No network services are available

# status.node_js_and_whistle_are_ready
source: Node.js 与 Whistle 已就绪
en: Node.js and Whistle are ready

# status.not_enabled
source: 未开启
en: Not Enabled

# status.only_some_network_services_are_using_this_proxy
source: 只有部分网络服务使用当前代理
en: Only some network services are using this proxy

# status.partially_connected
source: 部分接入
en: Partially Connected

# status.port_update_failed_value_restoring_the_previous_configuration_also_faile
source: 端口更新失败：%@；恢复旧配置失败：%@
en: Port update failed: %@; restoring the previous configuration also failed: %@

# status.port_update_failed_value_stopping_the_new_configuration_also_failed_valu
source: 端口更新失败：%@；停止新配置失败：%@
en: Port update failed: %@; stopping the new configuration also failed: %@

# status.ports_must_be_between_1_and_65535_and_the_proxy_and_web_ui_ports_must_di
source: 端口必须位于 1–65535，且代理端口和 Web UI 端口不能相同
en: Ports must be between 1 and 65535, and the proxy and Web UI ports must differ

# status.proxy_engine_stopped
source: 代理引擎已停止
en: Proxy Engine Stopped

# status.proxy_listening_only
source: 仅监听代理
en: Proxy Listening Only

# status.proxy_status_needs_attention
source: 代理状态需要检查
en: Proxy Status Needs Attention

# status.select_at_least_one_network_service
source: 请至少选择一个网络服务
en: Select at least one network service

# status.selected_network_services_are_using_the_local_proxy
source: 所选网络服务已指向本机代理
en: Selected network services are using the local proxy

# status.start_the_proxy_engine_first
source: 请先启动代理引擎
en: Start the proxy engine first

# status.starting
source: 正在启动
en: Starting

# status.starting_proxy_engine
source: 代理引擎启动中
en: Starting Proxy Engine

# status.starting_whistle
source: 正在启动 Whistle…
en: Starting Whistle…

# status.status_unavailable
source: 状态不可用
en: Status Unavailable

# status.stopped
source: 已停止
en: Stopped

# status.stopping
source: 正在停止
en: Stopping

# status.stopping_proxy_engine
source: 代理引擎停止中
en: Stopping Proxy Engine

# status.stopping_whistle
source: 正在停止 Whistle…
en: Stopping Whistle…

# status.system_proxy_enabled
source: 系统代理已开启
en: System Proxy Enabled

# status.the_configuration_was_imported_but_the_system_proxy_could_not_be_re_enab
source: 配置已导入，但系统代理未能重新启用
en: The configuration was imported, but the system proxy could not be re-enabled

# status.the_current_rules_are_missing_default_so_the_configuration_cannot_be_imp
source: 当前规则缺少 Default，无法导入配置
en: The current rules are missing Default, so the configuration cannot be imported

# status.the_current_rules_could_not_be_read_so_the_configuration_was_not_importe
source: 无法读取当前规则，配置未导入
en: The current rules could not be read, so the configuration was not imported

# status.the_node_js_or_whistle_environment_is_not_ready
source: Node.js 或 Whistle 环境未就绪
en: The Node.js or Whistle environment is not ready

# status.the_ports_were_updated_but_the_system_proxy_could_not_be_re_enabled
source: 端口已更新，但系统代理未能重新启用
en: The ports were updated, but the system proxy could not be re-enabled.

# status.the_previous_ports_were_restored_but_the_system_proxy_could_not_be_re_en
source: 旧端口已恢复，但系统代理未能重新启用
en: The previous ports were restored, but the system proxy could not be re-enabled.

# status.the_proxy_engine_is_not_ready_so_the_rule_configuration_cannot_be_applie
source: 代理引擎未就绪，无法应用规则配置
en: The proxy engine is not ready, so the rule configuration cannot be applied

# status.the_rule_to_update_could_not_be_found
source: 未找到要更新的规则
en: The rule to update could not be found

# status.unable_to_read_system_proxy_settings_value
source: 无法读取系统代理：%@
en: Unable to read system proxy settings: %@

# status.unable_to_update_dock_visibility
source: 无法更新程序坞显示状态
en: Unable to update Dock visibility

# status.wait_for_the_current_operation_to_finish_before_importing_a_configuratio
source: 请等待当前操作完成后再导入配置
en: Wait for the current operation to finish before importing a configuration

# status.wait_for_the_current_proxy_operation_to_finish_before_quitting
source: 请等待当前代理操作完成后再退出
en: Wait for the current proxy operation to finish before quitting.

# status.wait_for_the_current_proxy_operation_to_finish_then_try_again
source: 请等待当前代理操作完成后再试
en: Wait for the current proxy operation to finish, then try again.
